## PANDAS

In [1]:
import pandas as pd

In [2]:
s=pd.Series([1,2,3,4,5])
s

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [3]:
d=pd.DataFrame(s)

In [4]:
d

   0
0  1
1  2
2  3
3  4
4  5

In [10]:
dict={"Name":["Mona","Sona","Tina","Meena","Shakti","Swati","Abhinav","Lakshya","Virat"],"Age":[20,55,23,44,20,17,8,10,21]}
print(dict)
print(dict.keys())
print(dict.values())

{'Name': ['Mona', 'Sona', 'Tina', 'Meena', 'Shakti', 'Swati', 'Abhinav', 'Lakshya', 'Virat'], 'Age': [20, 55, 23, 44, 20, 17, 8, 10, 21]}
dict_keys(['Name', 'Age'])
dict_values([['Mona', 'Sona', 'Tina', 'Meena', 'Shakti', 'Swati', 'Abhinav', 'Lakshya', 'Virat'], [20, 55, 23, 44, 20, 17, 8, 10, 21]])

In [11]:
df=pd.DataFrame(dict)

In [12]:
df

      Name  Age
0     Mona   20
1     Sona   55
2     Tina   23
3    Meena   44
4   Shakti   20
5    Swati   17
6  Abhinav    8
7  Lakshya   10
8    Virat   21

In [14]:
df.head(2)

   Name  Age
0  Mona   20
1  Sona   55

In [15]:
df.head()

     Name  Age
0    Mona   20
1    Sona   55
2    Tina   23
3   Meena   44
4  Shakti   20

In [16]:
df.tail(3)

      Name  Age
6  Abhinav    8
7  Lakshya   10
8    Virat   21

In [18]:
df.tail()

      Name  Age
4   Shakti   20
5    Swati   17
6  Abhinav    8
7  Lakshya   10
8    Virat   21

## PANDAS OPERATIONS

In [20]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9 entries, 0 to 8
Data columns (total 2 columns):
Name    9 non-null object
Age     9 non-null int64
dtypes: int64(1), object(1)
memory usage: 272.0+ bytes

In [22]:
df.shape

(9, 2)

In [23]:
df.describe()

             Age
count   9.000000
mean   24.222222
std    15.425448
min     8.000000
25%    17.000000
50%    20.000000
75%    23.000000
max    55.000000

In [25]:
df['Age']

0    20
1    55
2    23
3    44
4    20
5    17
6     8
7    10
8    21
Name: Age, dtype: int64

In [26]:
df['Name']

0       Mona
1       Sona
2       Tina
3      Meena
4     Shakti
5      Swati
6    Abhinav
7    Lakshya
8      Virat
Name: Name, dtype: object

In [29]:
df.index

RangeIndex(start=0, stop=9, step=1)

In [30]:
df.values

array([['Mona', 20],
       ['Sona', 55],
       ['Tina', 23],
       ['Meena', 44],
       ['Shakti', 20],
       ['Swati', 17],
       ['Abhinav', 8],
       ['Lakshya', 10],
       ['Virat', 21]], dtype=object)

In [31]:
df.to_csv("Pandas.csv")

In [32]:
df.to_csv("Pandas1.csv",index=False)

In [35]:
data=pd.read_csv("Pandas1.csv")

In [36]:
data

      Name  Age
0     Mona   20
1     Sona   55
2     Tina   23
3    Meena   44
4   Shakti   20
5    Swati   17
6  Abhinav    8
7  Lakshya   10
8    Virat   21

In [38]:
data.sort_index(by="Age",inplace=True)

C:\Users\Pravleen\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: by argument to sort_index is deprecated, please use .sort_values(by=...)
  """Entry point for launching an IPython kernel.

In [39]:
data.head()

      Name  Age
6  Abhinav    8
7  Lakshya   10
5    Swati   17
0     Mona   20
4   Shakti   20

## LOC AND ILOC

In [40]:
df.loc[:2]

   Name  Age
0  Mona   20
1  Sona   55
2  Tina   23

In [47]:
df.loc[:,'Age']

0    20
1    55
2    23
3    44
4    20
5    17
6     8
7    10
8    21
Name: Age, dtype: int64

In [48]:
df.iloc[:,1]

0    20
1    55
2    23
3    44
4    20
5    17
6     8
7    10
8    21
Name: Age, dtype: int64

In [59]:
df.iloc[8:,:2]

    Name  Age
8  Virat   21

In [60]:
df.iloc[0:5,:1]

     Name
0    Mona
1    Sona
2    Tina
3   Meena
4  Shakti

## MEAN ,MEDIAN AND MODE

In [61]:
df["Age"].mean()

24.22222222222222

In [62]:
df["Age"].median()

20.0

In [63]:
df["Age"].mode()

0    20
dtype: int64

## TRANSPOSE

In [65]:
df.transpose()

         0     1     2      3       4      5        6        7      8
Name  Mona  Sona  Tina  Meena  Shakti  Swati  Abhinav  Lakshya  Virat
Age     20    55    23     44      20     17        8       10     21

In [67]:
s.T

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [68]:
df.T

         0     1     2      3       4      5        6        7      8
Name  Mona  Sona  Tina  Meena  Shakti  Swati  Abhinav  Lakshya  Virat
Age     20    55    23     44      20     17        8       10     21

## UNIQUE

In [69]:
df["Age"].unique()

array([20, 55, 23, 44, 17,  8, 10, 21], dtype=int64)

In [70]:
df["Age"].nunique()

8

In [72]:
data.reset_index(inplace=True)

In [73]:
data

   index     Name  Age
0      6  Abhinav    8
1      7  Lakshya   10
2      5    Swati   17
3      0     Mona   20
4      4   Shakti   20
5      8    Virat   21
6      2     Tina   23
7      3    Meena   44
8      1     Sona   55

In [76]:
data.rename(columns={"index":"Sr. No"},inplace=True)

In [77]:
data.set_index("Sr. No")

           Name  Age
Sr. No
6       Abhinav    8
7       Lakshya   10
5         Swati   17
0          Mona   20
4        Shakti   20
8         Virat   21
2          Tina   23
3         Meena   44
1          Sona   55